// 皇后在没有子的方格上，可以横直斜方向移动任意步，结合了车及象的走法。若路径上有对方的棋子，可以吃对方的棋子。

// 任务
// 编写一个函数availableMoves(position)，返回国际象棋中皇后的可能走法。返回值应该是一个按字母顺序排列的可能走法的数组，不包括起始位置。

// 例如，当输入位置为A1时，返回值应为:

// ["A2", "A3", "A4", "A5", "A6", "A7", "A8", "B1", "B2", "C1", "C3", "D1", "D4", "E1", "E5", "F1", "F6", "G1", "G7", "H1", "H8"]
//      A   B   C   D   E   F   G   H
//    + - + - + - + - + - + - + - + - +
// 1  | Q | x | x | x | x | x | x | x |
//    + - + - + - + - + - + - + - + - +
// 2  | x | x |   |   |   |   |   |   |
//    + - + - + - + - + - + - + - + - +
// 3  | x |   | x |   |   |   |   |   |
//    + - + - + - + - + - + - + - + - +
// 4  | x |   |   | x |   |   |   |   |
//    + - + - + - + - + - + - + - + - +
// 5  | x |   |   |   | x |   |   |   |
//    + - + - + - + - + - + - + - + - +
// 6  | x |   |   |   |   | x |   |   |
//    + - + - + - + - + - + - + - + - +
// 7  | x |   |   |   |   |   | x |   |
//    + - + - + - + - + - + - + - + - +
// 8  | x |   |   |   |   |   |   | x |
//    + - + - + - + - + - + - + - + - +

// Q = queen
// x = available move
// 输入
// 输入可以是任意类型（数组、数字、字符串等）。如果输入不是字符串，则返回空数组。

// 有效输入为 A 到 H 的字母加上 1 到 8 的数字，如A1、C8、B3。如果输入无效（例如 A10 或 H0），则返回空数组。